Amazon web services/SampleRequestMessageItemSearch.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://webservices.amazon.com/AWSECommerceService/2011-08-01">
   <soapenv:Header xmlns:aws="http://security.amazonaws.com/doc/2007-01-01/">
      <aws:AWSAccessKeyId>AKIAIYFLREOYORYNAQTQ</aws:AWSAccessKeyId>
      <aws:Timestamp>2016-01-27T18:43:46Z</aws:Timestamp>
      <aws:Signature>xxq+B9NdGrARDoR+6JNy9istkGs1SZrHmayUjGphIB8=</aws:Signature>
   </soapenv:Header>
   <soapenv:Body>
      <ns:ItemLookup>
         <ns:AssociateTag>test0e5d-20</ns:AssociateTag>
         <ResponseGroup>ItemAttributes</ResponseGroup>
         <SearchIndex>Books</SearchIndex>
         <IdType>ISBN</IdType>
         <ns:Request>
            <ns:ItemId>076243631X</ns:ItemId>
         </ns:Request>
      </ns:ItemLookup>
   </soapenv:Body>
</soapenv:Envelope>